Repository: Krizu9/flutter-GymDiary
Catalog: lib/l10n/app_*.arb
Languages: fi

source: Home Page
fi: Kotisivu

source: Settings Page
fi: Asetukset Sivu

source: English
fi: Englanti

source: Finnish
fi: Suomi

# workoutAddPage
source: Add Workout
fi: Lisää Harjoite

# workoutViewPage
source: View Workouts
fi: Tarkastele harjoitteita

# workoutTemplatePage
source: Add Workout Template
fi: Lisää Harjoite Pohja

source: Workouts
fi: Harjoitteet

source: Welcome
fi: Tervetuloa

source: Add Workout
fi: Lisää Harjoite

# workoutAddDescription
source: Add a new workout to your routine. Customize the workout with exercises, sets, reps, and more.
fi: Lisää uusi harjoitus rutiiniisi. Mukauta harjoitus liikkeillä, sarjoilla, toistoilla ja muilla asetuksilla.

# workoutViewDescription
source: View and track your past workouts. Analyze your progress and make adjustments to your training.
fi: Tarkastele ja seuraa aiempia harjoituksiasi. Analysoi edistymistäsi ja tee tarvittavat muutokset harjoitteluusi.

# workoutTemplateDescription
source: Create and manage workout templates. Save your favorite workouts to reuse them easily in the future.
fi: Luo ja hallitse harjoituspohjia. Tallenna suosikkiharjoituksesi käytettäväksi helposti myöhemmin.

source: No workout templates
fi: Ei harjoitepohjia

source: Movements
fi: Liikkeet

source: Add workout template
fi: Lisää harjoitepohja

source: Template name
fi: Pohjan nimi

source: Template movements
fi: Pohjan liikkeet

source: Cancel
fi: Peruuta

source: Save
fi: Tallenna

source: Add movement
fi: Lisää liike

source: Movement name
fi: Liikkeen nimi

source: Sets
fi: Sarjat

source: Edit workout template
fi: Muokkaa harjoitepohjaa

source: Workout saved
fi: Harjoite tallennettu

# workoutSaveError
source: Error when saving
fi: Virhe harjoitetta tallentaessa

# fetchError
source: Error fetching workout templates
fi: Virhe harjoitepohjien haussa

source: Set
fi: Sarja

source: Reps
fi: Toistot

source: Save changes
fi: Tallenna muutokset

# editMovements
source: Edit movement
fi: Muokkaa liikettä

source: No workouts for template
fi: Ei harjoitteita harjoitepohjassa

# deleteWorkoutConfirmation
source: Are you sure you want to delete this workout?
fi: Oletko varma että haluat poistaa treenin?

source: Confirm delete workout
fi: Vahvista poistaminen

source: Delete
fi: Poista

source: Workout edit page
fi: Harjoitteen muokkaamis sivu

source: Error
fi: Virhe

source: Invalid input
fi: Väärä syöte

source: Weights
fi: Painot

source: Movement
fi: Liike

# areYouSureClose
source: Are you sure you want to close?
fi: Haluatko varmasti sulkea?

source: Add set
fi: Lisää sarja

source: Weight
fi: Paino

source: No
fi: Ei

source: Yes
fi: Kyllä

# validMovementAndSets
source: Please enter valid movement and sets
fi: Syötä liikkeen nimi ja sarjat

# close
source: Sulje
fi: Close
